2D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0    0               0)
    (500  0               0)
    (0   -0.0348994967025 1)
    (0    0.0348994967025 1)
    (500 -0.0348994967025 1)
    (500  0.0348994967025 1)
);

blocks
(
    hex (0 1 1 0 2 4 5 3) (500 1 80) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 2 3 0)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 4 5 1)
        );
    }

    axis
    {
        type empty;
        faces
        (
            (0 1 1 0)
        );
    }

    outer-wall
    {
        type wall;
        faces
        (
            (3 2 4 5)
        );
    }

    front
    {
        type wedge;
        faces
        (
            (0 1 4 2)
        );
    }

    back
    {
        type wedge;
        faces
        (
            (0 1 5 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
