2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       79420;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       79500;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       79580;
    }
    outer-wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       79580;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          40000;
        startFace       80080;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          40000;
        startFace       120080;
    }
)

// ************************************************************************* //
